app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "updated_at", "name") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2024-02-07 03:41:54.624437"], ["updated_at", "2024-02-07 03:41:54.624437"], ["name", "Tester1"]]
---
    def create
      author = Author.new(author_params)

      if author.save