app/controllers/books_controller.rb

    def create
        book = Book.create! (book_params)
---
INSERT INTO "books" ("title", "genre", "yearpublished", "created_at", "updated_at", "quantity", "author_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"