app/controllers/borrowed_books_controller.rb

    def borrow_book
        @user = User.find(params[:user_id])
        @book = Book.find(params[:book_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1610], ["LIMIT", 1]]

    def return
        @borrowed_book = BorrowedBook.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1610], ["LIMIT", 1]]