app/controllers/users_controller.rb

INSERT INTO "users" ("username", "admin_number", "created_at", "updated_at", "admin_code", "password_digest") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", "newuser"], ["admin_number", nil], ["created_at", "2024-02-05 06:57:11.473932"], ["updated_at", "2024-02-05 06:57:11.473932"], ["admin_code", nil], ["password_digest", "[FILTERED]"]]
---
    def create
      @user = User.new(user_params)
      if @user.save